Repository: CherryHQ/cherry-studio-app
Catalog: modules/system-integration/ios/Resources/SystemIntegration.xcstrings
Source language: en
Languages: zh_hans

# title
source: Cherry Translate
zh_hans: Cherry 翻译

# target
source: Translate into
zh_hans: 目标语言

source: Original
zh_hans: 原文

# result
source: Translation
zh_hans: 译文

# running
source: Translating…
zh_hans: 正在翻译…

# copy
source: Copy translation
zh_hans: 复制译文

source: Copied
zh_hans: 已复制

source: Retry
zh_hans: 重试

source: Close
zh_hans: 关闭

# privacy
source: Cherry does not save translation records.
zh_hans: Cherry 不保存翻译记录。

# modelNotConfigured
source: Choose a translation model in Cherry → Settings → Model settings, then return here.
zh_hans: 请先打开 Cherry → 设置 → 模型设置，选择翻译模型。

# configurationStale
source: Translation settings changed. Open Cherry to sync them, then retry.
zh_hans: 翻译设置已变更。请打开 Cherry 同步设置后重试。

# credentialsUnavailable
source: Unlock your device and open Cherry to sync the model credentials.
zh_hans: 请解锁设备并打开 Cherry，同步模型密钥。

# modelUnavailable
source: The selected translation model is unavailable. Choose another model in Cherry.
zh_hans: 所选翻译模型不可用，请在 Cherry 中重新选择。

# providerUnavailable
source: The selected model provider is unavailable. Check its settings in Cherry.
zh_hans: 模型服务商不可用，请在 Cherry 中检查设置。

# unsupportedProvider
source: This model connection is not supported in the temporary window. Choose an HTTPS OpenAI Chat Completions compatible model with a standard API key in Cherry.
zh_hans: 当前模型连接暂不支持系统小窗口。请选择使用标准 API 密钥、支持 HTTPS OpenAI Chat Completions 的模型。

# invalidInput
source: Select some text to translate.
zh_hans: 请选择需要翻译的文字。

# inputTooLarge
source: Select a shorter passage (up to 16,000 characters).
zh_hans: 请选择更短的文字（最多 16,000 个字符）。

# authenticationFailed
source: The model credentials were rejected. Update them in Cherry.
zh_hans: 模型密钥未通过验证，请在 Cherry 中更新。

# rateLimited
source: The provider is rate limiting requests. Try again later.
zh_hans: 请求过于频繁，请稍后重试。

# timedOut
source: Translation timed out. Try again.
zh_hans: 翻译超时，请重试。

# networkUnavailable
source: Could not connect to the provider. Check your connection and retry.
zh_hans: 无法连接模型服务商，请检查网络后重试。

# invalidResult
source: The model did not return a complete translation. Try again.
zh_hans: 模型没有返回完整译文，请重试。

# failed
source: The action failed. Open Cherry to review its settings and try again.
zh_hans: 操作失败，请打开 Cherry 检查设置后重试。

# shareTitle
source: Share to Cherry
zh_hans: 分享到 Cherry

# shareSave
source: Save for Cherry
zh_hans: 保存到 Cherry 待确认

# shareTranslate
source: Temporary translation
zh_hans: 临时翻译

# shareSaved
source: Saved. Open Cherry to choose an Agent and review the content before sending.
zh_hans: 已保存。请打开 Cherry，选择 Agent 并确认内容后发送。

# sharePreparing
source: Preparing shared content…
zh_hans: 正在准备分享内容…

# shareFailed
source: Could not read this share. Share up to 10 files (25 MB each, 50 MB total) and try again.
zh_hans: 无法读取分享内容。最多支持 10 个文件，单文件 25 MB、总计 50 MB，请重新分享。
